api/app/controllers/beauty_products_controller.rb

SELECT "products".* FROM "products"
SELECT "beauty_products".* FROM "beauty_products"
---
  def index
    @beauty_products = BeautyProduct.all

INSERT INTO "beauty_products" ("name", "description", "price", "image_url", "category", "qty", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @beauty_product = BeautyProduct.new(beauty_product_params)

    if @beauty_product.save

UPDATE "beauty_products" SET "qty" = $1, "updated_at" = $2 WHERE "beauty_products"."id" = $3  [["qty", 25], ["updated_at", "2023-04-25 06:35:17.158822"], ["id", 4]]
---
  def update
    if @beauty_product.update(beauty_product_params)

DELETE FROM "beauty_products" WHERE "beauty_products"."id" = $1  [["id", 3]]
---
  def destroy
    @beauty_product.destroy

SELECT "beauty_products".* FROM "beauty_products" WHERE "beauty_products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_beauty_product
      @beauty_product = BeautyProduct.find(params[:id])