api/app/controllers/carts_controller.rb

  def create
    product = BeautyProduct.find(params[:id])
    quantity = params[:quantity] || 1
    cart_item = CartItem.new(product: product, quantity: quantity)
    if cart_item.save
---
SELECT "beauty_products".* FROM "beauty_products" WHERE "beauty_products"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
INSERT INTO "carts" ("product_id", "quantity", "active", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["product_id", nil], ["quantity", 2], ["active", nil], ["user_id", nil], ["created_at", "2023-04-25 07:32:24.131802"], ["updated_at", "2023-04-25 07:32:24.131802"]]

  def index
    cart_items = CartItem.all
---
SELECT "cart_items".* FROM "cart_items"