api/app/controllers/cart_items_controller.rb

SELECT "beauty_products".* FROM "beauty_products" WHERE "beauty_products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def create
    product = BeautyProduct.find(params[:beauty_product_id])