api/app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "email", "phone", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "edrftgyh"], ["email", nil], ["phone", nil], ["address", "hj"], ["created_at", "2023-04-25 08:03:24.958586"], ["updated_at", "2023-04-25 08:03:24.958586"]]
---
  def create
    @customer = Customer.new(customer_params)

    if @customer.save