api/app/controllers/products_controller.rb

  def find_product
    Product.find_by(id: params[:id]) || raise(ActiveRecord::RecordNotFound)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]