api/app/controllers/users_controller.rb

    def register
        user = User.create(user_params)
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "yuru"], ["email", "yurb@example.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-04-24 12:07:39.997813"], ["updated_at", "2023-04-24 12:07:39.997813"]]